In [1]:
#import library 
import pandas as pd
import numpy as np

In [26]:
# data
cuisine = pd.read_csv('chefmozcuisine.csv') 
user_cuisine = pd.read_csv('usercuisine.csv')
user_payment = pd.read_csv('userpayment.csv')
user_profile = pd.read_csv('userprofile.csv')

In [10]:
cuisine.head()

   placeID        Rcuisine
0   135110         Spanish
1   135109         Italian
2   135107  Latin_American
3   135106         Mexican
4   135105       Fast_Food

In [23]:
user_cuisine.head()

  userID          Rcuisine
0  U1001          American
1  U1002           Mexican
2  U1003           Mexican
3  U1004            Bakery
4  U1004  Breakfast-Brunch

In [15]:
user_payment.head()

  userID          Upayment
0  U1001              cash
1  U1002              cash
2  U1003              cash
3  U1004              cash
4  U1004  bank_debit_cards

In [27]:
user_profile.head()

,userID,latitude,longitude,smoker,drink_level,dress_preference,ambience,transport,marital_status,hijos,birth_year,interest,personality,religion,activity,color,weight,budget,height
0,U1001,22.139997,-100.978803,false,abstemious,informal,family,on foot,single,independent,1989,variety,thrifty-protector,none,student,black,69,medium,1.77
1,U1002,22.150087,-100.983325,false,abstemious,informal,family,public,single,independent,1990,technology,hunter-ostentatious,Catholic,student,red,40,low,1.87
2,U1003,22.119847,-100.946527,false,social drinker,formal,family,public,single,independent,1989,none,hard-worker,Catholic,student,blue,60,low,1.69
3,U1004,18.867000,-99.183000,false,abstemious,informal,family,public,single,independent,1940,variety,hard-worker,none,professional,green,44,medium,1.53
4,U1005,22.183477,-100.959891,false,abstemious,no preference,family,public,single,independent,1992,none,thrifty-protector,Catholic,student,black,65,medium,1.69

# Merging on a specific column

In [9]:
# merge_by_rcuisine on 'Rcuisine 
merge_by_rcuisine = pd.merge(cuisine , user_cuisine , on = 'Rcuisine')
merge_by_rcuisine.head()

   placeID Rcuisine userID
0   135110  Spanish  U1060
1   135110  Spanish  U1135
2   132770  Spanish  U1060
3   132770  Spanish  U1135
4   132273  Spanish  U1060

# Merging on columns with non-matching labels

In [25]:
# use left and right  "userID"
combined1 = pd.merge(user_payment , user_cuisine , left_on= 'userID' , right_on = 'userID')
combined1

    userID Upayment           Rcuisine
0    U1001     cash           American
1    U1002     cash            Mexican
2    U1003     cash            Mexican
3    U1004     cash             Bakery
4    U1004     cash   Breakfast-Brunch
..     ...      ...                ...
406  U1135     cash           Southern
407  U1135     cash  Dessert-Ice_Cream
408  U1136     cash            Mexican
409  U1137     cash            Mexican
410  U1138     cash           Pizzeria

[411 rows x 3 columns]

In [29]:
# use left and right  merge user profile and cuisine
combined2 = pd.merge(user_profile,user_cuisine , left_on = 'userID' , right_on = 'userID')
combined2

,userID,latitude,longitude,smoker,drink_level,dress_preference,ambience,transport,marital_status,hijos,birth_year,interest,personality,religion,activity,color,weight,budget,height,Rcuisine
0,U1001,22.139997,-100.978803,false,abstemious,informal,family,on foot,single,independent,1989,variety,thrifty-protector,none,student,black,69,medium,1.77,American
1,U1002,22.150087,-100.983325,false,abstemious,informal,family,public,single,independent,1990,technology,hunter-ostentatious,Catholic,student,red,40,low,1.87,Mexican
2,U1003,22.119847,-100.946527,false,social drinker,formal,family,public,single,independent,1989,none,hard-worker,Catholic,student,blue,60,low,1.69,Mexican
3,U1004,18.867000,-99.183000,false,abstemious,informal,family,public,single,independent,1940,variety,hard-worker,none,professional,green,44,medium,1.53,Bakery
4,U1004,18.867000,-99.183000,false,abstemious,informal,family,public,single,independent,1940,variety,hard-worker,none,professional,green,44,medium,1.53,Breakfast-Brunch
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
325,U1135,22.170396,-100.949936,false,casual drinker,informal,family,on foot,single,kids,1988,variety,hunter-ostentatious,Catholic,student,purple,66,low,1.54,Southern
326,U1135,22.170396,-100.949936,false,casual drinker,informal,family,on foot,single,kids,1988,variety,hunter-ostentatious,Catholic,student,purple,66,low,1.54,Dessert-Ice_Cream
327,U1136,22.149607,-100.997235,true,social drinker,no preference,friends,car owner,single,independent,1990,retro,thrifty-protector,Catholic,student,black,50,low,1.60,Mexican
328,U1137,22.144803,-100.944623,false,social drinker,formal,family,public,single,independent,1989,eco-friendly,hard-worker,Catholic,student,blue,72,low,1.78,Mexican
329,U1138,22.152884,-100.939663,false,social drinker,formal,friends,public,single,independent,1991,variety,thrifty-protector,none,student,blue,54,medium,1.55,Pizzeria

# Left & right merging on multiple columns

In [ ]:
# Merge sales and managers: sales_and_managers
# use how choose left

sales_and_managers = pd.merge(sales , managers , how= 'left' , left_on= ['city', 'state'] ,right_on=['branch', 'state'] )

# Merge order

In [ ]:
# Perform the first ordered merge: tx_weather
tx_weather = pd.merge_ordered(austin,houston)

In [ ]:
merge_asof()